{
  "main": {
    "name": "Rafid Akhter",
    "occupation": "Mechanical engineer and Software developer",
    "description": "I am  self-motivated and creative individual, interested in artificial intelligence and software engineering. Currently pursuing a career in this field and actively looking for software developer position. ",
    "image": "propic.jpg",
    "bio": "Hi, I am Rafid. I have graduated with a mechanical engineering degree from Carleton University in 2017 and I am a self-taught programmer. After graduation I have worked with Canadian Coast Guards, Environment Canada, and Natural Resources Canada. My interest in programming is a direct result of my innate need to find efficient ways of solving problems, that resulted in countless automation projects both in academia and in industry.",
    "contactmessage": "If you would like to get in contact please feel free send me an email with the form below or .",
    "email": "rafida9@gmail.com",
    "phone": "+1-613-864-3953",
    "address": {
      "city": "Ottawa",
      "state": "Ontario"
    },
    "website": "https://rafidakhter.github.io/myWebsite/",
    "resumedownload": "./Rafid Akhter Resume.pdf",
    "social": [
      {
        "name": "facebook",
        "url": "https://www.facebook.com/md.rafid.akhter/",
        "className": "fa fa-facebook"
      },

      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/rafid-akhter/",
        "className": "fa fa-linkedin"
      },
      {
        "name": "instagram",
        "url": "https://www.instagram.com/rafidakhter/",
        "className": "fa fa-instagram"
      },
      {
        "name": "github",
        "url": "https://github.com/rafidakhter",
        "className": "fa fa-github"
      }
    ]
  },
  "resume": {
    "skillmessage": "With a mechanical engineering background, I enjoyed doing mechatronics projects. My first personal project was to make my drone follow me while I am rock climbing. This project helped me to understand how computer vision is used for object detection, navigation and control systems. To further broaden my knowledge in core concepts of computer science and software engineering, I have taken online courses and learned advanced topics like data structures and algorithms, network communication protocol and web development. I have uploaded some of my projects on my GitHub page at ",
    "projectmessage": "With a mechanical engineering background, I enjoyed doing mechatronics projects. My first personal project was to make my drone follow me while I am rock climbing. This project helped me to understand how computer vision is used for object detection, navigation and control systems. To further broaden my knowledge in core concepts of computer science and software engineering, I have taken online courses and learned advanced topics like data structures and algorithms, network communication protocol and web development. I have uploaded some of my projects on my GitHub page at ",
    "education": [
      {
        "school": "Carleton University",
        "degree": "Bachelor of Enginnering , Mechanical -Co-op ",
        "graduated": "April 2017",
        "logo": "https://upload.wikimedia.org/wikipedia/en/8/82/Carleton_University_shield.png"
      }
    ],
    "work": [
      {
        "company": "Canadian Coast Guard",
        "title": "Junior Mechanical Engineer",
        "years": "May 2019 - January 2020",
        "description": "I was part of the vessel procurement team and in charge of designing mechanical systems for a future nearshore marine vessel project. I designed HVAC, Hybrid Propulsion, Waste Water Treatment and Fire Protection systems for the vessel. I have also product life cycle cost analysis and automated mechanical systems' product selection process.",
        "detials": [
          "Proposed a black and grey water distribution and treatment system which complies to vessel pollution and dangerous chemical regulations, Canada shipping Act",
          "Designed power generation system for a hybrid propulsion system based on electric and propulsion operation loads and created AutoCAD models of engine exhaust silencer and NOx reduction system",
          "Designed a fixed fire fighting system using BV ship building codes and Transport Canada’s vessel construction fire protection, detection, and extinction regulations"
        ],
        "logo": "https://upload.wikimedia.org/wikipedia/en/0/04/Canadian_Coast_Guard_crest.png"
      },
      {
        "company": "Environment and Climate Change Canada",
        "title": "Junior Mechanical Engineer",
        "years": "January 2019 - May 2019",
        "details": [
          "Configured in-house soot generator to mimic vehicular BC emissions for instrument calibration",
          "Established standardized BC measurement method(s) for transportation-generated emissions",
          "Evaluated the effectiveness and performance of BC control strategies to reduce BC emissions from on road vehicles"
        ],
        "description": "Being part of the ERMS team, the division who are in charge of testing road vehicles and marine vessel's gas emissions, I was in charge of developing strategies for sampling and data analysis of Black Carbon emissions.",
        "logo": "https://kootenayconservation.ca/wp-content/uploads/2020/04/Kootenay-Conservation-Program-Supporters-Environment-Canada.png"
      },
      {
        "company": "Natural Resources Canada",
        "title": "Air Emissions and Instrumentation Specialist",
        "years": "November 2017 - Deceber 2018",
        "description": "I assited in designing a Drone what would be used for analyzing Methane emissions from flare sites. Perfom project feasability studies based on statistical analysis.",
        "details": [
          "Integrates wind vector and gas concentration measurement system in an Unmanned Arial Vehicle for measuring methane flux",
          " Applied Monte Carlo analysis to horizontal wind speed sensor readings to the simulated total expected uncertainty in designed UAV system",
          " Wrote technical documents, SOP for operating and calibrating PASS-3 and OCEC analyzer"
        ],
        "logo": "https://www.policyschool.ca/wp-content/uploads/2017/04/Natural-Resources-Canada.png"
      },
      {
        "company": "FlareNet Carleton",
        "title": "Lab Assistant",
        "years": "April 2017 - November 2017",
        "detials": [
          "Calibrated and troubleshoot RS-232/485 digital communication mass flow controllers (MFC)",
          "Wrote LabVIEW code to get instrument readings",
          " Produced SOP for MFC calibration and train/supervise other project members on using the MFC"
        ],
        "description": "Assisted in lab set up. Automate data collection and data analysis from multiple sensors",
        "logo": "https://www.flarenet.ca/wp-content/uploads/2016/10/flarenet@2x.png"
      },
      {
        "company": "Best Theratonics",
        "title": "Co-op Student",
        "years": "May2014 - Dec 2015",
        "description": "I was assisting in designing in creating and extracting Technetium 99m (Radioactive Isotope) from molybdenum 99, for medical imiging purposes",
        "details": [
          "Made SolidWorks CAD model of checmical extraction process",
          "Propose alternate product protuction method which decreased the production time by 70%",
          "Wrote PLC code to control valves for fluid transfer"
        ],
        "logo": "https://aorticconference.org/wp-content/uploads/2015/10/best-theratronics.png"
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "Ecomerce Website",
        "description": "Designed and buit an E-comerce website. The back end was developed using Node.js,Express,Redux and MySQL. The front end was designed using React,Javascript,Bootsrtp.",
        "futurework": "Impliment 3rd party authentication service such as google and facebook. Impliment email notification services and product delivery status",
        "program": [
          "NodeJs",
          "express",
          "Javacsript",
          "HTML",
          "CSS",
          "React",
          "material-ui",
          "Bootstrap"
        ],
        "image": "handpose.jpg",

        "url": "https://www.notion.so/rafidakhter/E-commerce-Project-d5c0eae242724cb2971acb0a3f2cadc7"
      },
      {
        "title": "Smart Drone",

        "description": "A Tello Drone is programed to detect a human subject and follow that person by adjusting its pitch yaw and roll. A PID controller is implimented to contorll the drone. Multiple test has been conducted to find the optimum kp,kd and ki values ",
        "program": ["Python", "OpenCV"],
        "image": "smartdrone.jpg",
        "url": "https://github.com/rafidakhter/DroneFaceTracking",
        "path": "images/portfolio/"
      },
      {
        "title": "VR Air Paint",
        "description": "This python aplication allows user to draw objects in ait. The application is using open cv's image processing library to find HSV isolation model to isolate green objects in the frame as a contour. The cordinated of the contour is used to draw dots along the path of the green object making the illustration that the user is drawing in air",
        "futureWork": "Make a mobile/web app add on for zoom/googe hangout that will allow better communication in video conference",
        "program": ["Python", "OpenCV"],
        "image": "vrairpaint.jpg",
        "url": "https://github.com/rafidakhter/VRPaint",
        "path": "images/portfolio/"
      },
      {
        "title": "Weather App",
        "description": "This web app allows user to see weather details of desired location. This app is built using React, Bootstrap and Javascript ",
        "program": ["JavaScript", "React", "HTML", "CSS"],
        "image": "weather.jpg",
        "url": "https://weather-app-e359b.web.app/",
        "path": "images/portfolio/"
      },
      {
        "title": "Hand Pose recognition",
        "description": "An AI based hand recognition app, made using convolutional neural network model",
        "program": ["Tensorflow", "JavaScript", "React", "HTML", "CSS"],
        "image": "handpose.jpg",

        "url": "https://handrecognition-686b6.web.app/"
      }
    ]
  }
}
